tests/load/artillery-mute-all.yml
# MUTE_ALL 최적화 부하 테스트
#
# 측정 목적:
#   회의실 N명 상태에서 MUTE_ALL 발생 시 서버 처리 부하 측정
#   Before: server.emit(USER_UPDATE) N번 전역 브로드캐스트
#   After:  server.to(roomId).emit(MUTE_ALL_EXECUTED, { mutedSocketIds[] }) 1번
#
# 실행 (서버 먼저 기동):
#   # After — 현재 코드
#   artillery run tests/load/artillery-mute-all.yml \
#     --output tests/load/results/mute-all-after.json
#
#   # Before — git checkout <before-commit> 후
#   artillery run tests/load/artillery-mute-all.yml \
#     --output tests/load/results/mute-all-before.json
#
#   # 리포트 생성
#   artillery report tests/load/results/mute-all-after.json
#   artillery report tests/load/results/mute-all-before.json
#
# 환경변수 (DB에 존재하는 userId 필요):
#   USER_ID: 모든 VU가 사용할 userId (기본값: 1)
#            세션은 socketId 기준이므로 같은 userId로 다중 연결 가능
#
#   예) USER_ID=3 artillery run tests/load/artillery-mute-all.yml

config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Warm-up — 참여자 점진 입장 (~30명)"
    - duration: 30
      arrivalRate: 2
      name: "Ramp-up — 미팅룸 밀집 (~60명)"
    - duration: 30
      arrivalRate: 3
      name: "Peak — MUTE_ALL 집중 발생 구간 (~90명)"
    - duration: 20
      arrivalRate: 1
      name: "Cool-down"
  engines:
    socketio-v3:
      transports: ["websocket"]
      # socket.io handshake auth — game.gateway.ts handleConnection에서 userId 읽음
      # USER_ID 환경변수가 없으면 1 사용
      auth:
        userId: "1"

scenarios:
  # ── 시나리오 1: 호스트 (10%) ──────────────────────────────────────
  # lectern 진입 후 MUTE_ALL 반복 발송
  # 핵심 측정: mute-all ack 응답 시간, 방 인원 수에 따른 변화
  - name: "Host — lectern:enter + mute-all 반복"
    weight: 1
    engine: socketio-v3
    flow:
      - emit:
          channel: "room:join"
          data:
            roomId: "meeting-1"
      - think: 2
      - emit:
          channel: "lectern:enter"
          data:
            roomId: "meeting-1"
      - think: 3
      - loop:
          - emit:
              channel: "lectern:mute-all"
              data:
                roomId: "meeting-1"
          - think: 10
        count: 5

  # ── 시나리오 2: 참여자 (90%) ──────────────────────────────────────
  # 회의실 입장 후 연결 유지 → MUTE_ALL 수신 대상
  # 인원이 많을수록 Before에서는 서버 전역 emit N회 발생
  - name: "Member — meeting-1 입장 후 대기"
    weight: 9
    engine: socketio-v3
    flow:
      - emit:
          channel: "room:join"
          data:
            roomId: "meeting-1"
      - think: 55